In [35]:
import pandas as pd
import numpy as np

from sklearn.decomposition import PCA
from sklearn.preprocessing import StandardScaler# Estandarización a normal

import os

pd.options.display.float_format = '{:,.15f}'.format

# Lectura de datos

In [2]:
ruta_datos="C:\\Users\\MI10995\\Documents\\Capacitación\\Datos\\Pruebas_ML"
os.listdir(ruta_datos)

['ds_salaries.csv', 'Iris Flower Dataset_From Kaggle', 'titanic']

In [3]:
df=pd.read_csv(ruta_datos+"/ds_salaries.csv")
df=df.reset_index().rename(columns={"index":"id_"})

In [7]:
df["salary"].describe()

count        3,755.000000000000000
mean       190,695.571770972048398
std        671,676.500507907127030
min          6,000.000000000000000
25%        100,000.000000000000000
50%        138,000.000000000000000
75%        180,000.000000000000000
max     30,400,000.000000000000000
Name: salary, dtype: float64

# Ingeniería de Caracteristicas

In [9]:
# 0 Bajo, 1 Medio, 2 Alto
df["status_salary"]=df["salary"].map(lambda x: 0 if x<100000 else
                1 if (x>=100000)&(x<138000) else 2 )

In [27]:
vard_c=["experience_level","employment_type","job_title","employee_residence","company_size"]
varc_from_d=["numeric_"+f for f in vard_c]
varc=varc_from_d+["work_year","remote_ratio"]
um=["id_"]
y="status_salary"
df.head()

,id_,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,status_salary,numeric_experience_level,numeric_employment_type,numeric_job_title,numeric_employee_residence,numeric_company_size
0,0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L,0,0,0,0,0,0
1,1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S,0,1,1,1,1,1
2,2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S,0,1,1,1,1,1
3,3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M,2,0,0,2,2,2
4,4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M,1,0,0,2,2,2

In [20]:
#pd.get_dummies(df,columns=vard_c)
df[varc_from_d]=df[vard_c].apply(lambda x: pd.factorize(x)[0])

In [30]:
df[um+varc+[y]].head

# Análisis Exploratorio

In [39]:
tad=df[um+varc].copy()

In [40]:
sc=StandardScaler()
sc.fit(tad[varc])

StandardScaler()

In [41]:
tad[varc]=pd.DataFrame(sc.transform(tad[varc]),columns=varc)

In [ ]:
PCA()